# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11-pose keypoints/pose estimation model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/pose

# Parameters
nc: 1 # number of classes
kpt_shape: [9, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolo11n-pose.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 196 layers, 2908507 parameters, 2908491 gradients, 7.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 196 layers, 9948811 parameters, 9948795 gradients, 23.5 GFLOPs
  m: [0.50, 1.00, 512] # summary: 246 layers, 20973273 parameters, 20973257 gradients, 72.3 GFLOPs
  l: [1.00, 1.00, 512] # summary: 372 layers, 26230745 parameters, 26230729 gradients, 91.4 GFLOPs
  x: [1.00, 1.50, 512] # summary: 372 layers, 58889881 parameters, 58889865 gradients, 204.3 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]] # 4-P3 features

  # === 插入点 1: P3 后面的 MSCA ===
  - [-1, 1, MSCA, [32]]        # 5 (新层号，处理 P3 特征)

  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16 (原第5层 -> 变第6层)
  - [-1, 2, C3k2, [512, False, 0.25]] # 7-P4 features (原第6层 -> 变第7层)

  # === 插入点 2: P4 后面的 MSCA ===
  - [-1, 1, MSCA, [32]]        # 8 (新层号，处理 P4 特征)

  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32 (原第7层 -> 变第9层)
  - [-1, 2, C3k2, [1024, True, 0.25]] # 10 (原第8层 -> 变第10层)
  - [-1, 1, SPPF, [1024, 5]]    # 11 (原第9层 -> 变第11层)
  - [-1, 2, C2PSA, [1024]]      # 12 (原第10层 -> 变第12层)

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  # === Head 修改 1: 连接 P4 MSCA (第8层) ===
  # 原版是连接第 6 层，现在改连第 8 层
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  # === Head 修改 2: 连接 P3 MSCA (第5层) ===
  # 原版是连接第 4 层，现在改连第 5 层
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  # === Head 修改 3: 连接 P5 (第12层) ===
  # 原版是连接第 10 层 (C2PSA)，现在改连第 12 层
  - [[-1, 12], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Pose, [nc, kpt_shape]]  # Detect(P3, P4, P5)