# Ultralytics YOLOv5-pose (适配 YOLOv8 框架运行)
# 这是一个 "YOLOv5u" 风格的模型：V5的主干 + V8的Anchor-free头部
# 修改点：将 MSCA 注意力机制放置在 Backbone 的 SPPF 层之后

# Parameters
nc: 1 # 类别数
kpt_shape: [9, 3] # [关键点数量, 维度]

# Scales (对应 yolov5n/s/m/l/x)
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4
  - [-1, 3, C3, [128]]            # 2
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8
  - [-1, 6, C3, [256]]            # 4-P3 features (原汁原味，不加MSCA)

  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 9, C3, [512]]            # 6-P4 features (原汁原味，不加MSCA)

  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32
  - [-1, 3, C3, [1024]]           # 8
  - [-1, 1, SPPF, [1024, 5]]      # 9

  # === 插入点: SPPF 之后 ===
  - [-1, 1, MSCA, [32]]           # 10 (处理 SPPF 出来的深层特征)

# YOLOv5 v6.0 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11

  # === Head 对应修改 1: 连接 Backbone 的 P4 ===
  - [[-1, 6], 1, Concat, [1]]  # 12 cat backbone P4 (第6层是P4)
  - [-1, 3, C3, [512, False]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14

  # === Head 对应修改 2: 连接 Backbone 的 P3 ===
  - [[-1, 4], 1, Concat, [1]]  # 15 cat backbone P3 (第4层是P3)
  - [-1, 3, C3, [256, False]]  # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, Concat, [1]] # 18 cat head P4
  - [-1, 3, C3, [512, False]]  # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 20

  # === Head 对应修改 3: 连接 Backbone 最后输出 (SPPF+MSCA) ===
  - [[-1, 10], 1, Concat, [1]] # 21 cat head P5 (第10层是加入了 MSCA 的深层输出)
  - [-1, 3, C3, [1024, False]] # 22 (P5/32-large)

  # Pose 检测头索引跟着变化 (16对应P3, 19对应P4, 22对应P5)
  - [[16, 19, 22], 1, Pose, [nc, kpt_shape]]  # 23 Detect(P3, P4, P5)