# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11-pose keypoints/pose estimation model with P3/8 - P5/32 outputs
# 修改点：移除 P3/P4 的 MSCA，将 MSCA 仅插入到 Backbone 的 SPPF 层之后

# Parameters
nc: 1 # number of classes
kpt_shape: [9, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolo11n-pose.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]] # 4-P3 features (恢复原版)

  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, False, 0.25]] # 6-P4 features (恢复原版)

  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True, 0.25]] # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9

  # === 插入点: SPPF 之后 ===
  - [-1, 1, MSCA, [32]]         # 10 (紧跟在 SPPF 后面，处理深层空间特征)

  - [-1, 2, C2PSA, [1024]]      # 11 (主干网络末端的自注意力块，接收 MSCA 的输出)

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12

  # === Head 对应修改 1: 连接 Backbone 的 P4 ===
  - [[-1, 6], 1, Concat, [1]]  # 13 cat backbone P4 (第6层是原始P4)
  - [-1, 2, C3k2, [512, False]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15

  # === Head 对应修改 2: 连接 Backbone 的 P3 ===
  - [[-1, 4], 1, Concat, [1]]  # 16 cat backbone P3 (第4层是原始P3)
  - [-1, 2, C3k2, [256, False]] # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 14], 1, Concat, [1]] # 19 cat head P4
  - [-1, 2, C3k2, [512, False]] # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 21

  # === Head 对应修改 3: 连接 Backbone 的 P5 ===
  - [[-1, 11], 1, Concat, [1]] # 22 cat head P5 (第11层是 C2PSA)
  - [-1, 2, C3k2, [1024, True]] # 23 (P5/32-large)

  # Pose 检测头索引更新
  - [[17, 20, 23], 1, Pose, [nc, kpt_shape]]  # 24 Detect(P3, P4, P5)